Revit 2027 API
EnergyDataSettings.SillHeight Property
Note: This API is now obsolete.
 Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The height from the nearest lower level used for auto-glazing created on walls.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public double SillHeight { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property SillHeight As Double
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property double SillHeight {
	double get ();
	void set (double value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member SillHeight : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The sill height is less than zero.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace